---
title: StairsRunType
classe: Autodesk.Revit.DB.Architecture.StairsRunType
namespace: Autodesk.Revit.DB.Architecture
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 16
---

# StairsRunType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean HasRisers { get; set; }` | `stairsRunType.HasRisers` | Boolean |
| `Boolean HasTreads { get; set; }` | `stairsRunType.HasTreads` | Boolean |
| `Boolean IsMonolithic { get; }` | `stairsRunType.IsMonolithic` | Boolean |
| `Boolean IsSlanted { get; set; }` | `stairsRunType.IsSlanted` | Boolean |
| `ElementId MaterialId { get; set; }` | `stairsRunType.MaterialId` | ElementId |
| `Double NosingLength { get; set; }` | `stairsRunType.NosingLength` | Double |
| `ElementId NosingProfile { get; set; }` | `stairsRunType.NosingProfile` | ElementId |
| `ElementId RiserProfile { get; set; }` | `stairsRunType.RiserProfile` | ElementId |
| `Double RiserThickness { get; set; }` | `stairsRunType.RiserThickness` | Double |
| `RiserToTreadConnectionOption RiserToTreadConnect { get; set; }` | `stairsRunType.RiserToTreadConnect` | RiserToTreadConnectionOption |
| `Double StructuralDepth { get; set; }` | `stairsRunType.StructuralDepth` | Double |
| `Double TotalDepth { get; }` | `stairsRunType.TotalDepth` | Double |
| `TreadNosingPosition TreadNosingPosition { get; set; }` | `stairsRunType.TreadNosingPosition` | TreadNosingPosition |
| `ElementId TreadProfile { get; set; }` | `stairsRunType.TreadProfile` | ElementId |
| `Double TreadThickness { get; set; }` | `stairsRunType.TreadThickness` | Double |
| `StairsUndersideSurfaceStyle UndersideSurfaceStyle { get; set; }` | `stairsRunType.UndersideSurfaceStyle` | StairsUndersideSurfaceStyle |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```